weather_data = {
    "ගාල්ල" : {
         -3 : {
             "කාලගුණය" : "ප්‍රධාන වශයෙන් වැසි රහිතයි\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (30-40) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 10mm",
        },
         -2 : {
             "කාලගුණය" : "සවස 2.00න් පසුව වැසි හෝ ගිගුරුම් සහිත වැසි ඇති  විය හැක\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (60-65) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 80mm",
        },
        -1 : {
             "කාලගුණය" : "සිහින් වැසි වාර කිහිපයක්\nඋපරිම උෂ්ණත්වය - 34°C\nඅවම උෂ්ණත්වය - 24°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 50%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 40%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 50mm",
        },
        0 : {
             "කාලගුණය" : "වැසි ස්වල්පයක්\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (50-55) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 70%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 30mm",
        },
        1 : {
             "කාලගුණය" : "වැසි වාර කිහිපයක්\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 22°C",
             "සුළග" : "සුළං නැගෙනහිර දිසාවට පැ.කි.මී. (15-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 90%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 15mm",
        },
        2 : {
             "කාලගුණය" : "ගිගුරුම් සහිත තද වැසි\nඋපරිම උෂ්ණත්වය - 33°C\nඅවම උෂ්ණත්වය - 27°C",
             "සුළග" : "සුළං බස්නාහිර දෙසින් හමා එයි. පැ.කි.මී. (60-70) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 98%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 80%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 38.7mm",
        },
        3 : {
             "කාලගුණය" : "වියලි කාලගුණ තත්ත්වයක්\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 26°C",
             "සුළග" : "සුළං වයඹ දිසාවට පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 75%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 40mm",
        }
    },
     "නුවර" : {
         -3 : {
             "කාලගුණය" : "වළාකුලින් බර, ප්‍රධාන වශයෙන් වැසි රහිතයි\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 20°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (30-40) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 100mm",
        },
         -2 : {
             "කාලගුණය" : "සවස 2.00න් පසුව වැසි හෝ ගිගුරුම් සහිත වැසි ඇති  විය හැක\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 21°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (60-65) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 80mm",
        },
        -1 : {
             "කාලගුණය" : "සිහින් වැසි වාර කිහිපයක්\nඋපරිම උෂ්ණත්වය - 29°C\nඅවම උෂ්ණත්වය - 24°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 50%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 40%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 60mm",
        },
        0 : {
             "කාලගුණය" : "වැසි බර කාලගුණයක්\nඋපරිම උෂ්ණත්වය - 22°C\nඅවම උෂ්ණත්වය - 18°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (50-55) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 70%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 130mm",
        },
        1 : {
             "කාලගුණය" : "දැඩි මීදුම් සහිතයි. වැසි වාර කිහිපයක්\nඋපරිම උෂ්ණත්වය - 20°C\nඅවම උෂ්ණත්වය - 12°C",
             "සුළග" : "සුළං නැගෙනහිර දිසාවට පැ.කි.මී. (15-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 90%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 75mm",
        },
        2 : {
             "කාලගුණය" : "ගිගුරුම් සහිත තද වැසි\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 22°C",
             "සුළග" : "සුළං බස්නාහිර දෙසින් හමා එයි. පැ.කි.මී. (60-70) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 98%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 80%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 88.7mm",
        },
        3 : {
             "කාලගුණය" : "වියලි කාලගුණ තත්ත්වයක්\nඋපරිම උෂ්ණත්වය - 22°C\nඅවම උෂ්ණත්වය - 16°C",
             "සුළග" : "සුළං වයඹ දිසාවට පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 75%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 60mm",
        }
    },
     "හම්බන්තොට" : {
         -3 : {
             "කාලගුණය" : "ප්‍රධාන වශයෙන් වැසි රහිතයි\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (30-40) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 10mm",
        },
         -2 : {
             "කාලගුණය" : "සවස 2.00න් පසුව වැසි හෝ ගිගුරුම් සහිත වැසි ඇති  විය හැක\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (60-65) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 80mm",
        },
        -1 : {
             "කාලගුණය" : "සිහින් වැසි වාර කිහිපයක්\nඋපරිම උෂ්ණත්වය - 34°C\nඅවම උෂ්ණත්වය - 24°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 50%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 40%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 50mm",
        },
        0 : {
             "කාලගුණය" : "ඉතාමත් වියලි\nඋපරිම උෂ්ණත්වය - 36°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (50-55) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 70%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 5mm",
        },
        1 : {
             "කාලගුණය" : "වලාකුළු රහිත වියලි කාලගුණයක්\nඋපරිම උෂ්ණත්වය - 34°C\nඅවම උෂ්ණත්වය - 26°C",
             "සුළග" : "සුළං නැගෙනහිර දිසාවට පැ.කි.මී. (15-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 90%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 15mm",
        },
        2 : {
             "කාලගුණය" : "ගිගුරුම් සහිත තද වැසි\nඋපරිම උෂ්ණත්වය - 33°C\nඅවම උෂ්ණත්වය - 27°C",
             "සුළග" : "සුළං බස්නාහිර දෙසින් හමා එයි. පැ.කි.මී. (60-70) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 98%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 80%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 38.7mm",
        },
        3 : {
             "කාලගුණය" : "වියලි කාලගුණ තත්ත්වයක්\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 26°C",
             "සුළග" : "සුළං වයඹ දිසාවට පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 75%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 40mm",
        }
    },
     "මාතලේ" : {
         -3 : {
             "කාලගුණය" : "වළාකුලින් බර, ප්‍රධාන වශයෙන් වැසි රහිතයි\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 20°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (30-40) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 100mm",
        },
         -2 : {
             "කාලගුණය" : "සවස 2.00න් පසුව වැසි හෝ ගිගුරුම් සහිත වැසි ඇති  විය හැක\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 21°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (60-65) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 80mm",
        },
        -1 : {
             "කාලගුණය" : "සිහින් වැසි වාර කිහිපයක්\nඋපරිම උෂ්ණත්වය - 29°C\nඅවම උෂ්ණත්වය - 24°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 50%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 40%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 60mm",
        },
        0 : {
             "කාලගුණය" : "වැසි බර කාලගුණයක්\nඋපරිම උෂ්ණත්වය - 22°C\nඅවම උෂ්ණත්වය - 18°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (50-55) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 70%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 130mm",
        },
        1 : {
             "කාලගුණය" : "දැඩි මීදුම් සහිතයි. වැසි වාර කිහිපයක්\nඋපරිම උෂ්ණත්වය - 20°C\nඅවම උෂ්ණත්වය - 12°C",
             "සුළග" : "සුළං නැගෙනහිර දිසාවට පැ.කි.මී. (15-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 90%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 75mm",
        },
        2 : {
             "කාලගුණය" : "ගිගුරුම් සහිත තද වැසි\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 22°C",
             "සුළග" : "සුළං බස්නාහිර දෙසින් හමා එයි. පැ.කි.මී. (60-70) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 98%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 80%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 88.7mm",
        },
        3 : {
             "කාලගුණය" : "වියලි කාලගුණ තත්ත්වයක්\nඋපරිම උෂ්ණත්වය - 22°C\nඅවම උෂ්ණත්වය - 16°C",
             "සුළග" : "සුළං වයඹ දිසාවට පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 75%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 60mm",
        }
    },
     "කළුතර" : {
         -3 : {
             "කාලගුණය" : "ප්‍රධාන වශයෙන් වැසි රහිතයි\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (30-40) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 10mm",
        },
         -2 : {
             "කාලගුණය" : "සවස 2.00න් පසුව වැසි හෝ ගිගුරුම් සහිත වැසි ඇති  විය හැක\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (60-65) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 80mm",
        },
        -1 : {
             "කාලගුණය" : "සිහින් වැසි වාර කිහිපයක්\nඋපරිම උෂ්ණත්වය - 34°C\nඅවම උෂ්ණත්වය - 24°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 50%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 40%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 50mm",
        },
        0 : {
             "කාලගුණය" : "වැසි ස්වල්පයක්\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (50-55) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 70%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 30mm",
        },
        1 : {
             "කාලගුණය" : "වැසි වාර කිහිපයක්\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 22°C",
             "සුළග" : "සුළං නැගෙනහිර දිසාවට පැ.කි.මී. (15-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 90%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 15mm",
        },
        2 : {
             "කාලගුණය" : "ගිගුරුම් සහිත තද වැසි\nඋපරිම උෂ්ණත්වය - 33°C\nඅවම උෂ්ණත්වය - 27°C",
             "සුළග" : "සුළං බස්නාහිර දෙසින් හමා එයි. පැ.කි.මී. (60-70) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 98%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 80%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 38.7mm",
        },
        3 : {
             "කාලගුණය" : "වියලි කාලගුණ තත්ත්වයක්\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 26°C",
             "සුළග" : "සුළං වයඹ දිසාවට පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 75%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 40mm",
        }
    },
     "මාතර" : {
         -3 : {
             "කාලගුණය" : "ප්‍රධාන වශයෙන් වැසි රහිතයි\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (30-40) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 10mm",
        },
         -2 : {
             "කාලගුණය" : "සවස 2.00න් පසුව වැසි හෝ ගිගුරුම් සහිත වැසි ඇති  විය හැක\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (60-65) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 80mm",
        },
        -1 : {
             "කාලගුණය" : "සිහින් වැසි වාර කිහිපයක්\nඋපරිම උෂ්ණත්වය - 34°C\nඅවම උෂ්ණත්වය - 24°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 50%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 40%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 50mm",
        },
        0 : {
             "කාලගුණය" : "වැසි ස්වල්පයක්\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (50-55) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 70%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 30mm",
        },
        1 : {
             "කාලගුණය" : "වැසි වාර කිහිපයක්\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 22°C",
             "සුළග" : "සුළං නැගෙනහිර දිසාවට පැ.කි.මී. (15-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 90%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 15mm",
        },
        2 : {
             "කාලගුණය" : "ගිගුරුම් සහිත තද වැසි\nඋපරිම උෂ්ණත්වය - 33°C\nඅවම උෂ්ණත්වය - 27°C",
             "සුළග" : "සුළං බස්නාහිර දෙසින් හමා එයි. පැ.කි.මී. (60-70) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 98%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 80%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 38.7mm",
        },
        3 : {
             "කාලගුණය" : "වියලි කාලගුණ තත්ත්වයක්\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 26°C",
             "සුළග" : "සුළං වයඹ දිසාවට පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 75%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 40mm",
        }
    },
     "අනුරාධපුර" : {
         -3 : {
             "කාලගුණය" : "ප්‍රධාන වශයෙන් වැසි රහිතයි\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (30-40) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 10mm",
        },
         -2 : {
             "කාලගුණය" : "සවස 2.00න් පසුව වැසි හෝ ගිගුරුම් සහිත වැසි ඇති  විය හැක\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (60-65) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 80mm",
        },
        -1 : {
             "කාලගුණය" : "සිහින් වැසි වාර කිහිපයක්\nඋපරිම උෂ්ණත්වය - 34°C\nඅවම උෂ්ණත්වය - 24°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 50%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 40%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 50mm",
        },
        0 : {
             "කාලගුණය" : "ඉතාමත් වියලි\nඋපරිම උෂ්ණත්වය - 36°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (50-55) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 70%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 5mm",
        },
        1 : {
             "කාලගුණය" : "වලාකුළු රහිත වියලි කාලගුණයක්\nඋපරිම උෂ්ණත්වය - 34°C\nඅවම උෂ්ණත්වය - 26°C",
             "සුළග" : "සුළං නැගෙනහිර දිසාවට පැ.කි.මී. (15-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 90%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 15mm",
        },
        2 : {
             "කාලගුණය" : "ගිගුරුම් සහිත තද වැසි\nඋපරිම උෂ්ණත්වය - 33°C\nඅවම උෂ්ණත්වය - 27°C",
             "සුළග" : "සුළං බස්නාහිර දෙසින් හමා එයි. පැ.කි.මී. (60-70) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 98%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 80%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 38.7mm",
        },
        3 : {
             "කාලගුණය" : "වියලි කාලගුණ තත්ත්වයක්\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 26°C",
             "සුළග" : "සුළං වයඹ දිසාවට පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 75%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 40mm",
        }
    },
     "ගම්පහ" : {
         -3 : {
             "කාලගුණය" : "ප්‍රධාන වශයෙන් වැසි රහිතයි\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (30-40) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 10mm",
        },
         -2 : {
             "කාලගුණය" : "සවස 2.00න් පසුව වැසි හෝ ගිගුරුම් සහිත වැසි ඇති  විය හැක\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (60-65) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 80mm",
        },
        -1 : {
             "කාලගුණය" : "සිහින් වැසි වාර කිහිපයක්\nඋපරිම උෂ්ණත්වය - 34°C\nඅවම උෂ්ණත්වය - 24°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 50%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 40%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 50mm",
        },
        0 : {
             "කාලගුණය" : "වැසි ස්වල්පයක්\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (50-55) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 70%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 30mm",
        },
        1 : {
             "කාලගුණය" : "වැසි වාර කිහිපයක්\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 22°C",
             "සුළග" : "සුළං නැගෙනහිර දිසාවට පැ.කි.මී. (15-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 90%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 15mm",
        },
        2 : {
             "කාලගුණය" : "ගිගුරුම් සහිත තද වැසි\nඋපරිම උෂ්ණත්වය - 33°C\nඅවම උෂ්ණත්වය - 27°C",
             "සුළග" : "සුළං බස්නාහිර දෙසින් හමා එයි. පැ.කි.මී. (60-70) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 98%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 80%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 38.7mm",
        },
        3 : {
             "කාලගුණය" : "වියලි කාලගුණ තත්ත්වයක්\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 26°C",
             "සුළග" : "සුළං වයඹ දිසාවට පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 75%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 40mm",
        }
    },
     "මන්නාරම" : {
         -3 : {
             "කාලගුණය" : "ප්‍රධාන වශයෙන් වැසි රහිතයි\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (30-40) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 10mm",
        },
         -2 : {
             "කාලගුණය" : "සවස 2.00න් පසුව වැසි හෝ ගිගුරුම් සහිත වැසි ඇති  විය හැක\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (60-65) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 80mm",
        },
        -1 : {
             "කාලගුණය" : "සිහින් වැසි වාර කිහිපයක්\nඋපරිම උෂ්ණත්වය - 34°C\nඅවම උෂ්ණත්වය - 24°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 50%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 40%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 50mm",
        },
        0 : {
             "කාලගුණය" : "ඉතාමත් වියලි\nඋපරිම උෂ්ණත්වය - 36°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (50-55) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 70%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 5mm",
        },
        1 : {
             "කාලගුණය" : "වලාකුළු රහිත වියලි කාලගුණයක්\nඋපරිම උෂ්ණත්වය - 34°C\nඅවම උෂ්ණත්වය - 26°C",
             "සුළග" : "සුළං නැගෙනහිර දිසාවට පැ.කි.මී. (15-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 90%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 15mm",
        },
        2 : {
             "කාලගුණය" : "ගිගුරුම් සහිත තද වැසි\nඋපරිම උෂ්ණත්වය - 33°C\nඅවම උෂ්ණත්වය - 27°C",
             "සුළග" : "සුළං බස්නාහිර දෙසින් හමා එයි. පැ.කි.මී. (60-70) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 98%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 80%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 38.7mm",
        },
        3 : {
             "කාලගුණය" : "වියලි කාලගුණ තත්ත්වයක්\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 26°C",
             "සුළග" : "සුළං වයඹ දිසාවට පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 75%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 40mm",
        }
    },
     "කොළඹ" : {
         -3 : {
             "කාලගුණය" : "ප්‍රධාන වශයෙන් වැසි රහිතයි\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (30-40) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 10mm",
        },
         -2 : {
             "කාලගුණය" : "සවස 2.00න් පසුව වැසි හෝ ගිගුරුම් සහිත වැසි ඇති  විය හැක\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (60-65) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 80mm",
        },
        -1 : {
             "කාලගුණය" : "සිහින් වැසි වාර කිහිපයක්\nඋපරිම උෂ්ණත්වය - 34°C\nඅවම උෂ්ණත්වය - 24°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 50%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 40%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 50mm",
        },
        0 : {
             "කාලගුණය" : "වැසි ස්වල්පයක්\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (50-55) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 70%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 30mm",
        },
        1 : {
             "කාලගුණය" : "වැසි වාර කිහිපයක්\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 22°C",
             "සුළග" : "සුළං නැගෙනහිර දිසාවට පැ.කි.මී. (15-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 90%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 15mm",
        },
        2 : {
             "කාලගුණය" : "ගිගුරුම් සහිත තද වැසි\nඋපරිම උෂ්ණත්වය - 33°C\nඅවම උෂ්ණත්වය - 27°C",
             "සුළග" : "සුළං බස්නාහිර දෙසින් හමා එයි. පැ.කි.මී. (60-70) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 98%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 80%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 38.7mm",
        },
        3 : {
             "කාලගුණය" : "වියලි කාලගුණ තත්ත්වයක්\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 26°C",
             "සුළග" : "සුළං වයඹ දිසාවට පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 75%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 40mm",
        }
    },
     "යාපනය" : {
         -3 : {
             "කාලගුණය" : "ප්‍රධාන වශයෙන් වැසි රහිතයි\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (30-40) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 10mm",
        },
         -2 : {
             "කාලගුණය" : "සවස 2.00න් පසුව වැසි හෝ ගිගුරුම් සහිත වැසි ඇති  විය හැක\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (60-65) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 80mm",
        },
        -1 : {
             "කාලගුණය" : "සිහින් වැසි වාර කිහිපයක්\nඋපරිම උෂ්ණත්වය - 34°C\nඅවම උෂ්ණත්වය - 24°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 50%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 40%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 50mm",
        },
        0 : {
             "කාලගුණය" : "ඉතාමත් වියලි\nඋපරිම උෂ්ණත්වය - 36°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (50-55) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 70%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 5mm",
        },
        1 : {
             "කාලගුණය" : "වලාකුළු රහිත වියලි කාලගුණයක්\nඋපරිම උෂ්ණත්වය - 34°C\nඅවම උෂ්ණත්වය - 26°C",
             "සුළග" : "සුළං නැගෙනහිර දිසාවට පැ.කි.මී. (15-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 90%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 15mm",
        },
        2 : {
             "කාලගුණය" : "ගිගුරුම් සහිත තද වැසි\nඋපරිම උෂ්ණත්වය - 33°C\nඅවම උෂ්ණත්වය - 27°C",
             "සුළග" : "සුළං බස්නාහිර දෙසින් හමා එයි. පැ.කි.මී. (60-70) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 98%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 80%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 38.7mm",
        },
        3 : {
             "කාලගුණය" : "වියලි කාලගුණ තත්ත්වයක්\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 26°C",
             "සුළග" : "සුළං වයඹ දිසාවට පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 75%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 40mm",
        }
    },
     "පොළොන්නරුව" : {
         -3 : {
             "කාලගුණය" : "ප්‍රධාන වශයෙන් වැසි රහිතයි\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (30-40) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 10mm",
        },
         -2 : {
             "කාලගුණය" : "සවස 2.00න් පසුව වැසි හෝ ගිගුරුම් සහිත වැසි ඇති  විය හැක\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (60-65) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 80mm",
        },
        -1 : {
             "කාලගුණය" : "සිහින් වැසි වාර කිහිපයක්\nඋපරිම උෂ්ණත්වය - 34°C\nඅවම උෂ්ණත්වය - 24°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 50%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 40%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 50mm",
        },
        0 : {
             "කාලගුණය" : "ඉතාමත් වියලි\nඋපරිම උෂ්ණත්වය - 36°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (50-55) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 70%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 5mm",
        },
        1 : {
             "කාලගුණය" : "වලාකුළු රහිත වියලි කාලගුණයක්\nඋපරිම උෂ්ණත්වය - 34°C\nඅවම උෂ්ණත්වය - 26°C",
             "සුළග" : "සුළං නැගෙනහිර දිසාවට පැ.කි.මී. (15-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 90%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 15mm",
        },
        2 : {
             "කාලගුණය" : "ගිගුරුම් සහිත තද වැසි\nඋපරිම උෂ්ණත්වය - 33°C\nඅවම උෂ්ණත්වය - 27°C",
             "සුළග" : "සුළං බස්නාහිර දෙසින් හමා එයි. පැ.කි.මී. (60-70) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 98%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 80%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 38.7mm",
        },
        3 : {
             "කාලගුණය" : "වියලි කාලගුණ තත්ත්වයක්\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 26°C",
             "සුළග" : "සුළං වයඹ දිසාවට පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 75%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 40mm",
        }
    },
     "නුවරඑළිය" : {
         -3 : {
             "කාලගුණය" : "වළාකුලින් බර, ප්‍රධාන වශයෙන් වැසි රහිතයි\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 20°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (30-40) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 100mm",
        },
         -2 : {
             "කාලගුණය" : "සවස 2.00න් පසුව වැසි හෝ ගිගුරුම් සහිත වැසි ඇති  විය හැක\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 21°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (60-65) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 80mm",
        },
        -1 : {
             "කාලගුණය" : "සිහින් වැසි වාර කිහිපයක්\nඋපරිම උෂ්ණත්වය - 29°C\nඅවම උෂ්ණත්වය - 24°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 50%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 40%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 60mm",
        },
        0 : {
             "කාලගුණය" : "වැසි බර කාලගුණයක්\nඋපරිම උෂ්ණත්වය - 22°C\nඅවම උෂ්ණත්වය - 18°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (50-55) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 70%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 130mm",
        },
        1 : {
             "කාලගුණය" : "දැඩි මීදුම් සහිතයි. වැසි වාර කිහිපයක්\nඋපරිම උෂ්ණත්වය - 20°C\nඅවම උෂ්ණත්වය - 12°C",
             "සුළග" : "සුළං නැගෙනහිර දිසාවට පැ.කි.මී. (15-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 90%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 75mm",
        },
        2 : {
             "කාලගුණය" : "ගිගුරුම් සහිත තද වැසි\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 22°C",
             "සුළග" : "සුළං බස්නාහිර දෙසින් හමා එයි. පැ.කි.මී. (60-70) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 98%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 80%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 88.7mm",
        },
        3 : {
             "කාලගුණය" : "වියලි කාලගුණ තත්ත්වයක්\nඋපරිම උෂ්ණත්වය - 22°C\nඅවම උෂ්ණත්වය - 16°C",
             "සුළග" : "සුළං වයඹ දිසාවට පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 75%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 60mm",
        }
    },
     "කිලිනොච්චි" : {
         -3 : {
             "කාලගුණය" : "ප්‍රධාන වශයෙන් වැසි රහිතයි\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (30-40) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 10mm",
        },
         -2 : {
             "කාලගුණය" : "සවස 2.00න් පසුව වැසි හෝ ගිගුරුම් සහිත වැසි ඇති  විය හැක\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (60-65) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 80mm",
        },
        -1 : {
             "කාලගුණය" : "සිහින් වැසි වාර කිහිපයක්\nඋපරිම උෂ්ණත්වය - 34°C\nඅවම උෂ්ණත්වය - 24°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 50%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 40%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 50mm",
        },
        0 : {
             "කාලගුණය" : "ඉතාමත් වියලි\nඋපරිම උෂ්ණත්වය - 36°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (50-55) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 70%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 5mm",
        },
        1 : {
             "කාලගුණය" : "වලාකුළු රහිත වියලි කාලගුණයක්\nඋපරිම උෂ්ණත්වය - 34°C\nඅවම උෂ්ණත්වය - 26°C",
             "සුළග" : "සුළං නැගෙනහිර දිසාවට පැ.කි.මී. (15-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 90%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 15mm",
        },
        2 : {
             "කාලගුණය" : "ගිගුරුම් සහිත තද වැසි\nඋපරිම උෂ්ණත්වය - 33°C\nඅවම උෂ්ණත්වය - 27°C",
             "සුළග" : "සුළං බස්නාහිර දෙසින් හමා එයි. පැ.කි.මී. (60-70) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 98%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 80%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 38.7mm",
        },
        3 : {
             "කාලගුණය" : "වියලි කාලගුණ තත්ත්වයක්\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 26°C",
             "සුළග" : "සුළං වයඹ දිසාවට පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 75%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 40mm",
        }
    },
     "කුරුණෑගල" : {
         -3 : {
             "කාලගුණය" : "ප්‍රධාන වශයෙන් වැසි රහිතයි\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (30-40) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 10mm",
        },
         -2 : {
             "කාලගුණය" : "සවස 2.00න් පසුව වැසි හෝ ගිගුරුම් සහිත වැසි ඇති  විය හැක\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (60-65) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 80mm",
        },
        -1 : {
             "කාලගුණය" : "සිහින් වැසි වාර කිහිපයක්\nඋපරිම උෂ්ණත්වය - 34°C\nඅවම උෂ්ණත්වය - 24°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 50%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 40%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 50mm",
        },
        0 : {
             "කාලගුණය" : "වැසි ස්වල්පයක්\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (50-55) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 70%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 30mm",
        },
        1 : {
             "කාලගුණය" : "වැසි වාර කිහිපයක්\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 22°C",
             "සුළග" : "සුළං නැගෙනහිර දිසාවට පැ.කි.මී. (15-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 90%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 15mm",
        },
        2 : {
             "කාලගුණය" : "ගිගුරුම් සහිත තද වැසි\nඋපරිම උෂ්ණත්වය - 33°C\nඅවම උෂ්ණත්වය - 27°C",
             "සුළග" : "සුළං බස්නාහිර දෙසින් හමා එයි. පැ.කි.මී. (60-70) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 98%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 80%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 38.7mm",
        },
        3 : {
             "කාලගුණය" : "වියලි කාලගුණ තත්ත්වයක්\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 26°C",
             "සුළග" : "සුළං වයඹ දිසාවට පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 75%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 40mm",
        }
    },
     "ත්‍රීකුණාමලය" : {
         -3 : {
             "කාලගුණය" : "ප්‍රධාන වශයෙන් වැසි රහිතයි\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (30-40) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 10mm",
        },
         -2 : {
             "කාලගුණය" : "සවස 2.00න් පසුව වැසි හෝ ගිගුරුම් සහිත වැසි ඇති  විය හැක\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (60-65) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 80mm",
        },
        -1 : {
             "කාලගුණය" : "සිහින් වැසි වාර කිහිපයක්\nඋපරිම උෂ්ණත්වය - 34°C\nඅවම උෂ්ණත්වය - 24°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 50%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 40%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 50mm",
        },
        0 : {
             "කාලගුණය" : "ඉතාමත් වියලි\nඋපරිම උෂ්ණත්වය - 36°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (50-55) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 70%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 5mm",
        },
        1 : {
             "කාලගුණය" : "වලාකුළු රහිත වියලි කාලගුණයක්\nඋපරිම උෂ්ණත්වය - 34°C\nඅවම උෂ්ණත්වය - 26°C",
             "සුළග" : "සුළං නැගෙනහිර දිසාවට පැ.කි.මී. (15-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 90%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 15mm",
        },
        2 : {
             "කාලගුණය" : "ගිගුරුම් සහිත තද වැසි\nඋපරිම උෂ්ණත්වය - 33°C\nඅවම උෂ්ණත්වය - 27°C",
             "සුළග" : "සුළං බස්නාහිර දෙසින් හමා එයි. පැ.කි.මී. (60-70) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 98%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 80%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 38.7mm",
        },
        3 : {
             "කාලගුණය" : "වියලි කාලගුණ තත්ත්වයක්\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 26°C",
             "සුළග" : "සුළං වයඹ දිසාවට පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 75%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 40mm",
        }
    },
     "අම්පාර" : {
         -3 : {
             "කාලගුණය" : "ප්‍රධාන වශයෙන් වැසි රහිතයි\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (30-40) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 10mm",
        },
         -2 : {
             "කාලගුණය" : "සවස 2.00න් පසුව වැසි හෝ ගිගුරුම් සහිත වැසි ඇති  විය හැක\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (60-65) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 80mm",
        },
        -1 : {
             "කාලගුණය" : "සිහින් වැසි වාර කිහිපයක්\nඋපරිම උෂ්ණත්වය - 34°C\nඅවම උෂ්ණත්වය - 24°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 50%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 40%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 50mm",
        },
        0 : {
             "කාලගුණය" : "ඉතාමත් වියලි\nඋපරිම උෂ්ණත්වය - 36°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (50-55) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 70%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 5mm",
        },
        1 : {
             "කාලගුණය" : "වලාකුළු රහිත වියලි කාලගුණයක්\nඋපරිම උෂ්ණත්වය - 34°C\nඅවම උෂ්ණත්වය - 26°C",
             "සුළග" : "සුළං නැගෙනහිර දිසාවට පැ.කි.මී. (15-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 90%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 15mm",
        },
        2 : {
             "කාලගුණය" : "ගිගුරුම් සහිත තද වැසි\nඋපරිම උෂ්ණත්වය - 33°C\nඅවම උෂ්ණත්වය - 27°C",
             "සුළග" : "සුළං බස්නාහිර දෙසින් හමා එයි. පැ.කි.මී. (60-70) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 98%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 80%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 38.7mm",
        },
        3 : {
             "කාලගුණය" : "වියලි කාලගුණ තත්ත්වයක්\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 26°C",
             "සුළග" : "සුළං වයඹ දිසාවට පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 75%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 40mm",
        }
    },
     "මඩකලපුව" : {
         -3 : {
             "කාලගුණය" : "ප්‍රධාන වශයෙන් වැසි රහිතයි\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (30-40) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 10mm",
        },
         -2 : {
             "කාලගුණය" : "සවස 2.00න් පසුව වැසි හෝ ගිගුරුම් සහිත වැසි ඇති  විය හැක\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (60-65) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 80mm",
        },
        -1 : {
             "කාලගුණය" : "සිහින් වැසි වාර කිහිපයක්\nඋපරිම උෂ්ණත්වය - 34°C\nඅවම උෂ්ණත්වය - 24°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 50%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 40%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 50mm",
        },
        0 : {
             "කාලගුණය" : "ඉතාමත් වියලි\nඋපරිම උෂ්ණත්වය - 36°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (50-55) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 70%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 5mm",
        },
        1 : {
             "කාලගුණය" : "වලාකුළු රහිත වියලි කාලගුණයක්\nඋපරිම උෂ්ණත්වය - 34°C\nඅවම උෂ්ණත්වය - 26°C",
             "සුළග" : "සුළං නැගෙනහිර දිසාවට පැ.කි.මී. (15-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 90%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 15mm",
        },
        2 : {
             "කාලගුණය" : "ගිගුරුම් සහිත තද වැසි\nඋපරිම උෂ්ණත්වය - 33°C\nඅවම උෂ්ණත්වය - 27°C",
             "සුළග" : "සුළං බස්නාහිර දෙසින් හමා එයි. පැ.කි.මී. (60-70) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 98%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 80%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 38.7mm",
        },
        3 : {
             "කාලගුණය" : "වියලි කාලගුණ තත්ත්වයක්\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 26°C",
             "සුළග" : "සුළං වයඹ දිසාවට පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 75%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 40mm",
        }
    },
     "පුත්තලම" : {
         -3 : {
             "කාලගුණය" : "ප්‍රධාන වශයෙන් වැසි රහිතයි\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (30-40) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 10mm",
        },
         -2 : {
             "කාලගුණය" : "සවස 2.00න් පසුව වැසි හෝ ගිගුරුම් සහිත වැසි ඇති  විය හැක\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (60-65) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 80mm",
        },
        -1 : {
             "කාලගුණය" : "සිහින් වැසි වාර කිහිපයක්\nඋපරිම උෂ්ණත්වය - 34°C\nඅවම උෂ්ණත්වය - 24°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 50%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 40%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 50mm",
        },
        0 : {
             "කාලගුණය" : "වැසි ස්වල්පයක්\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (50-55) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 70%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 30mm",
        },
        1 : {
             "කාලගුණය" : "වැසි වාර කිහිපයක්\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 22°C",
             "සුළග" : "සුළං නැගෙනහිර දිසාවට පැ.කි.මී. (15-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 90%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 15mm",
        },
        2 : {
             "කාලගුණය" : "ගිගුරුම් සහිත තද වැසි\nඋපරිම උෂ්ණත්වය - 33°C\nඅවම උෂ්ණත්වය - 27°C",
             "සුළග" : "සුළං බස්නාහිර දෙසින් හමා එයි. පැ.කි.මී. (60-70) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 98%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 80%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 38.7mm",
        },
        3 : {
             "කාලගුණය" : "වියලි කාලගුණ තත්ත්වයක්\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 26°C",
             "සුළග" : "සුළං වයඹ දිසාවට පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 75%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 40mm",
        }
    },
     "බදුල්ල" : {
         -3 : {
             "කාලගුණය" : "වළාකුලින් බර, ප්‍රධාන වශයෙන් වැසි රහිතයි\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 20°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (30-40) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 100mm",
        },
         -2 : {
             "කාලගුණය" : "සවස 2.00න් පසුව වැසි හෝ ගිගුරුම් සහිත වැසි ඇති  විය හැක\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 21°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (60-65) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 80mm",
        },
        -1 : {
             "කාලගුණය" : "සිහින් වැසි වාර කිහිපයක්\nඋපරිම උෂ්ණත්වය - 29°C\nඅවම උෂ්ණත්වය - 24°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 50%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 40%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 60mm",
        },
        0 : {
             "කාලගුණය" : "වැසි බර කාලගුණයක්\nඋපරිම උෂ්ණත්වය - 22°C\nඅවම උෂ්ණත්වය - 18°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (50-55) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 70%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 130mm",
        },
        1 : {
             "කාලගුණය" : "දැඩි මීදුම් සහිතයි. වැසි වාර කිහිපයක්\nඋපරිම උෂ්ණත්වය - 20°C\nඅවම උෂ්ණත්වය - 12°C",
             "සුළග" : "සුළං නැගෙනහිර දිසාවට පැ.කි.මී. (15-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 90%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 75mm",
        },
        2 : {
             "කාලගුණය" : "ගිගුරුම් සහිත තද වැසි\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 22°C",
             "සුළග" : "සුළං බස්නාහිර දෙසින් හමා එයි. පැ.කි.මී. (60-70) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 98%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 80%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 88.7mm",
        },
        3 : {
             "කාලගුණය" : "වියලි කාලගුණ තත්ත්වයක්\nඋපරිම උෂ්ණත්වය - 22°C\nඅවම උෂ්ණත්වය - 16°C",
             "සුළග" : "සුළං වයඹ දිසාවට පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 75%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 60mm",
        }
    },
     "මොණරාගල" : {
         -3 : {
             "කාලගුණය" : "ප්‍රධාන වශයෙන් වැසි රහිතයි\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (30-40) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 10mm",
        },
         -2 : {
             "කාලගුණය" : "සවස 2.00න් පසුව වැසි හෝ ගිගුරුම් සහිත වැසි ඇති  විය හැක\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (60-65) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 80mm",
        },
        -1 : {
             "කාලගුණය" : "සිහින් වැසි වාර කිහිපයක්\nඋපරිම උෂ්ණත්වය - 34°C\nඅවම උෂ්ණත්වය - 24°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 50%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 40%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 50mm",
        },
        0 : {
             "කාලගුණය" : "ඉතාමත් වියලි\nඋපරිම උෂ්ණත්වය - 36°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (50-55) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 70%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 5mm",
        },
        1 : {
             "කාලගුණය" : "වලාකුළු රහිත වියලි කාලගුණයක්\nඋපරිම උෂ්ණත්වය - 34°C\nඅවම උෂ්ණත්වය - 26°C",
             "සුළග" : "සුළං නැගෙනහිර දිසාවට පැ.කි.මී. (15-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 90%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 15mm",
        },
        2 : {
             "කාලගුණය" : "ගිගුරුම් සහිත තද වැසි\nඋපරිම උෂ්ණත්වය - 33°C\nඅවම උෂ්ණත්වය - 27°C",
             "සුළග" : "සුළං බස්නාහිර දෙසින් හමා එයි. පැ.කි.මී. (60-70) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 98%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 80%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 38.7mm",
        },
        3 : {
             "කාලගුණය" : "වියලි කාලගුණ තත්ත්වයක්\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 26°C",
             "සුළග" : "සුළං වයඹ දිසාවට පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 75%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 40mm",
        }
    },
     "රත්නපුර" : {
         -3 : {
             "කාලගුණය" : "ප්‍රධාන වශයෙන් වැසි රහිතයි\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (30-40) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 10mm",
        },
         -2 : {
             "කාලගුණය" : "සවස 2.00න් පසුව වැසි හෝ ගිගුරුම් සහිත වැසි ඇති  විය හැක\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (60-65) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 80mm",
        },
        -1 : {
             "කාලගුණය" : "සිහින් වැසි වාර කිහිපයක්\nඋපරිම උෂ්ණත්වය - 34°C\nඅවම උෂ්ණත්වය - 24°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 50%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 40%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 50mm",
        },
        0 : {
             "කාලගුණය" : "වැසි ස්වල්පයක්\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (50-55) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 70%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 30mm",
        },
        1 : {
             "කාලගුණය" : "වැසි වාර කිහිපයක්\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 22°C",
             "සුළග" : "සුළං නැගෙනහිර දිසාවට පැ.කි.මී. (15-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 90%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 15mm",
        },
        2 : {
             "කාලගුණය" : "ගිගුරුම් සහිත තද වැසි\nඋපරිම උෂ්ණත්වය - 33°C\nඅවම උෂ්ණත්වය - 27°C",
             "සුළග" : "සුළං බස්නාහිර දෙසින් හමා එයි. පැ.කි.මී. (60-70) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 98%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 80%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 38.7mm",
        },
        3 : {
             "කාලගුණය" : "වියලි කාලගුණ තත්ත්වයක්\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 26°C",
             "සුළග" : "සුළං වයඹ දිසාවට පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 75%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 40mm",
        }
    },
     "කෑගල්ල" : {
         -3 : {
             "කාලගුණය" : "ප්‍රධාන වශයෙන් වැසි රහිතයි\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (30-40) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 10mm",
        },
         -2 : {
             "කාලගුණය" : "සවස 2.00න් පසුව වැසි හෝ ගිගුරුම් සහිත වැසි ඇති  විය හැක\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (60-65) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 80mm",
        },
        -1 : {
             "කාලගුණය" : "සිහින් වැසි වාර කිහිපයක්\nඋපරිම උෂ්ණත්වය - 34°C\nඅවම උෂ්ණත්වය - 24°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 50%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 40%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 50mm",
        },
        0 : {
             "කාලගුණය" : "වැසි ස්වල්පයක්\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (50-55) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 70%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 30mm",
        },
        1 : {
             "කාලගුණය" : "වැසි වාර කිහිපයක්\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 22°C",
             "සුළග" : "සුළං නැගෙනහිර දිසාවට පැ.කි.මී. (15-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 90%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 15mm",
        },
        2 : {
             "කාලගුණය" : "ගිගුරුම් සහිත තද වැසි\nඋපරිම උෂ්ණත්වය - 33°C\nඅවම උෂ්ණත්වය - 27°C",
             "සුළග" : "සුළං බස්නාහිර දෙසින් හමා එයි. පැ.කි.මී. (60-70) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 98%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 80%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 38.7mm",
        },
        3 : {
             "කාලගුණය" : "වියලි කාලගුණ තත්ත්වයක්\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 26°C",
             "සුළග" : "සුළං වයඹ දිසාවට පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 75%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 40mm",
        }
    },
     "උතුරු" : {
         -3 : {
             "කාලගුණය" : "ප්‍රධාන වශයෙන් වැසි රහිතයි\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (30-40) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 10mm",
        },
         -2 : {
             "කාලගුණය" : "සවස 2.00න් පසුව වැසි හෝ ගිගුරුම් සහිත වැසි ඇති  විය හැක\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (60-65) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 80mm",
        },
        -1 : {
             "කාලගුණය" : "සිහින් වැසි වාර කිහිපයක්\nඋපරිම උෂ්ණත්වය - 34°C\nඅවම උෂ්ණත්වය - 24°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 50%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 40%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 50mm",
        },
        0 : {
             "කාලගුණය" : "ඉතාමත් වියලි\nඋපරිම උෂ්ණත්වය - 36°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (50-55) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 70%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 5mm",
        },
        1 : {
             "කාලගුණය" : "වලාකුළු රහිත වියලි කාලගුණයක්\nඋපරිම උෂ්ණත්වය - 34°C\nඅවම උෂ්ණත්වය - 26°C",
             "සුළග" : "සුළං නැගෙනහිර දිසාවට පැ.කි.මී. (15-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 90%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 15mm",
        },
        2 : {
             "කාලගුණය" : "ගිගුරුම් සහිත තද වැසි\nඋපරිම උෂ්ණත්වය - 33°C\nඅවම උෂ්ණත්වය - 27°C",
             "සුළග" : "සුළං බස්නාහිර දෙසින් හමා එයි. පැ.කි.මී. (60-70) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 98%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 80%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 38.7mm",
        },
        3 : {
             "කාලගුණය" : "වියලි කාලගුණ තත්ත්වයක්\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 26°C",
             "සුළග" : "සුළං වයඹ දිසාවට පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 75%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 40mm",
        }
    },
     "දකුණු" : {
         -3 : {
             "කාලගුණය" : "ප්‍රධාන වශයෙන් වැසි රහිතයි\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (30-40) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 10mm",
        },
         -2 : {
             "කාලගුණය" : "සවස 2.00න් පසුව වැසි හෝ ගිගුරුම් සහිත වැසි ඇති  විය හැක\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (60-65) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 80mm",
        },
        -1 : {
             "කාලගුණය" : "සිහින් වැසි වාර කිහිපයක්\nඋපරිම උෂ්ණත්වය - 34°C\nඅවම උෂ්ණත්වය - 24°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 50%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 40%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 50mm",
        },
        0 : {
             "කාලගුණය" : "වැසි ස්වල්පයක්\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (50-55) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 70%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 30mm",
        },
        1 : {
             "කාලගුණය" : "වැසි වාර කිහිපයක්\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 22°C",
             "සුළග" : "සුළං නැගෙනහිර දිසාවට පැ.කි.මී. (15-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 90%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 15mm",
        },
        2 : {
             "කාලගුණය" : "ගිගුරුම් සහිත තද වැසි\nඋපරිම උෂ්ණත්වය - 33°C\nඅවම උෂ්ණත්වය - 27°C",
             "සුළග" : "සුළං බස්නාහිර දෙසින් හමා එයි. පැ.කි.මී. (60-70) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 98%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 80%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 38.7mm",
        },
        3 : {
             "කාලගුණය" : "වියලි කාලගුණ තත්ත්වයක්\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 26°C",
             "සුළග" : "සුළං වයඹ දිසාවට පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 75%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 40mm",
        }
    },
     "ඌව" : {
         -3 : {
             "කාලගුණය" : "ප්‍රධාන වශයෙන් වැසි රහිතයි\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (30-40) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 10mm",
        },
         -2 : {
             "කාලගුණය" : "සවස 2.00න් පසුව වැසි හෝ ගිගුරුම් සහිත වැසි ඇති  විය හැක\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (60-65) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 80mm",
        },
        -1 : {
             "කාලගුණය" : "සිහින් වැසි වාර කිහිපයක්\nඋපරිම උෂ්ණත්වය - 34°C\nඅවම උෂ්ණත්වය - 24°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 50%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 40%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 50mm",
        },
        0 : {
             "කාලගුණය" : "ඉතාමත් වියලි\nඋපරිම උෂ්ණත්වය - 36°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (50-55) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 70%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 5mm",
        },
        1 : {
             "කාලගුණය" : "වලාකුළු රහිත වියලි කාලගුණයක්\nඋපරිම උෂ්ණත්වය - 34°C\nඅවම උෂ්ණත්වය - 26°C",
             "සුළග" : "සුළං නැගෙනහිර දිසාවට පැ.කි.මී. (15-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 90%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 15mm",
        },
        2 : {
             "කාලගුණය" : "ගිගුරුම් සහිත තද වැසි\nඋපරිම උෂ්ණත්වය - 33°C\nඅවම උෂ්ණත්වය - 27°C",
             "සුළග" : "සුළං බස්නාහිර දෙසින් හමා එයි. පැ.කි.මී. (60-70) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 98%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 80%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 38.7mm",
        },
        3 : {
             "කාලගුණය" : "වියලි කාලගුණ තත්ත්වයක්\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 26°C",
             "සුළග" : "සුළං වයඹ දිසාවට පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 75%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 40mm",
        }
    },
     "උතුරුමැද" : {
         -3 : {
             "කාලගුණය" : "ප්‍රධාන වශයෙන් වැසි රහිතයි\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (30-40) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 10mm",
        },
         -2 : {
             "කාලගුණය" : "සවස 2.00න් පසුව වැසි හෝ ගිගුරුම් සහිත වැසි ඇති  විය හැක\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (60-65) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 80mm",
        },
        -1 : {
             "කාලගුණය" : "සිහින් වැසි වාර කිහිපයක්\nඋපරිම උෂ්ණත්වය - 34°C\nඅවම උෂ්ණත්වය - 24°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 50%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 40%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 50mm",
        },
        0 : {
             "කාලගුණය" : "ඉතාමත් වියලි\nඋපරිම උෂ්ණත්වය - 36°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (50-55) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 70%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 5mm",
        },
        1 : {
             "කාලගුණය" : "වලාකුළු රහිත වියලි කාලගුණයක්\nඋපරිම උෂ්ණත්වය - 34°C\nඅවම උෂ්ණත්වය - 26°C",
             "සුළග" : "සුළං නැගෙනහිර දිසාවට පැ.කි.මී. (15-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 90%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 15mm",
        },
        2 : {
             "කාලගුණය" : "ගිගුරුම් සහිත තද වැසි\nඋපරිම උෂ්ණත්වය - 33°C\nඅවම උෂ්ණත්වය - 27°C",
             "සුළග" : "සුළං බස්නාහිර දෙසින් හමා එයි. පැ.කි.මී. (60-70) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 98%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 80%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 38.7mm",
        },
        3 : {
             "කාලගුණය" : "වියලි කාලගුණ තත්ත්වයක්\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 26°C",
             "සුළග" : "සුළං වයඹ දිසාවට පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 75%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 40mm",
        }
    },
     "වයඹ" : {
         -3 : {
             "කාලගුණය" : "ප්‍රධාන වශයෙන් වැසි රහිතයි\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (30-40) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 10mm",
        },
         -2 : {
             "කාලගුණය" : "සවස 2.00න් පසුව වැසි හෝ ගිගුරුම් සහිත වැසි ඇති  විය හැක\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (60-65) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 80mm",
        },
        -1 : {
             "කාලගුණය" : "සිහින් වැසි වාර කිහිපයක්\nඋපරිම උෂ්ණත්වය - 34°C\nඅවම උෂ්ණත්වය - 24°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 50%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 40%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 50mm",
        },
        0 : {
             "කාලගුණය" : "වැසි ස්වල්පයක්\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (50-55) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 70%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 30mm",
        },
        1 : {
             "කාලගුණය" : "වැසි වාර කිහිපයක්\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 22°C",
             "සුළග" : "සුළං නැගෙනහිර දිසාවට පැ.කි.මී. (15-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 90%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 15mm",
        },
        2 : {
             "කාලගුණය" : "ගිගුරුම් සහිත තද වැසි\nඋපරිම උෂ්ණත්වය - 33°C\nඅවම උෂ්ණත්වය - 27°C",
             "සුළග" : "සුළං බස්නාහිර දෙසින් හමා එයි. පැ.කි.මී. (60-70) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 98%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 80%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 38.7mm",
        },
        3 : {
             "කාලගුණය" : "වියලි කාලගුණ තත්ත්වයක්\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 26°C",
             "සුළග" : "සුළං වයඹ දිසාවට පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 75%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 40mm",
        }
    },
     "සබරගමුව" : {
         -3 : {
             "කාලගුණය" : "ප්‍රධාන වශයෙන් වැසි රහිතයි\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (30-40) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 10mm",
        },
         -2 : {
             "කාලගුණය" : "සවස 2.00න් පසුව වැසි හෝ ගිගුරුම් සහිත වැසි ඇති  විය හැක\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (60-65) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 80mm",
        },
        -1 : {
             "කාලගුණය" : "සිහින් වැසි වාර කිහිපයක්\nඋපරිම උෂ්ණත්වය - 34°C\nඅවම උෂ්ණත්වය - 24°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 50%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 40%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 50mm",
        },
        0 : {
             "කාලගුණය" : "වැසි ස්වල්පයක්\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (50-55) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 70%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 30mm",
        },
        1 : {
             "කාලගුණය" : "වැසි වාර කිහිපයක්\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 22°C",
             "සුළග" : "සුළං නැගෙනහිර දිසාවට පැ.කි.මී. (15-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 90%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 15mm",
        },
        2 : {
             "කාලගුණය" : "ගිගුරුම් සහිත තද වැසි\nඋපරිම උෂ්ණත්වය - 33°C\nඅවම උෂ්ණත්වය - 27°C",
             "සුළග" : "සුළං බස්නාහිර දෙසින් හමා එයි. පැ.කි.මී. (60-70) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 98%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 80%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 38.7mm",
        },
        3 : {
             "කාලගුණය" : "වියලි කාලගුණ තත්ත්වයක්\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 26°C",
             "සුළග" : "සුළං වයඹ දිසාවට පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 75%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 40mm",
        }
    },
     "නැගෙනහිර" : {
         -3 : {
             "කාලගුණය" : "ප්‍රධාන වශයෙන් වැසි රහිතයි\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (30-40) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 10mm",
        },
         -2 : {
             "කාලගුණය" : "සවස 2.00න් පසුව වැසි හෝ ගිගුරුම් සහිත වැසි ඇති  විය හැක\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (60-65) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 80mm",
        },
        -1 : {
             "කාලගුණය" : "සිහින් වැසි වාර කිහිපයක්\nඋපරිම උෂ්ණත්වය - 34°C\nඅවම උෂ්ණත්වය - 24°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 50%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 40%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 50mm",
        },
        0 : {
             "කාලගුණය" : "ඉතාමත් වියලි\nඋපරිම උෂ්ණත්වය - 36°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (50-55) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 70%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 5mm",
        },
        1 : {
             "කාලගුණය" : "වලාකුළු රහිත වියලි කාලගුණයක්\nඋපරිම උෂ්ණත්වය - 34°C\nඅවම උෂ්ණත්වය - 26°C",
             "සුළග" : "සුළං නැගෙනහිර දිසාවට පැ.කි.මී. (15-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 90%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 15mm",
        },
        2 : {
             "කාලගුණය" : "ගිගුරුම් සහිත තද වැසි\nඋපරිම උෂ්ණත්වය - 33°C\nඅවම උෂ්ණත්වය - 27°C",
             "සුළග" : "සුළං බස්නාහිර දෙසින් හමා එයි. පැ.කි.මී. (60-70) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 98%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 80%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 38.7mm",
        },
        3 : {
             "කාලගුණය" : "වියලි කාලගුණ තත්ත්වයක්\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 26°C",
             "සුළග" : "සුළං වයඹ දිසාවට පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 75%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 40mm",
        }
    },
     "බස්නාහිර" : {
         -3 : {
             "කාලගුණය" : "ප්‍රධාන වශයෙන් වැසි රහිතයි\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (30-40) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 10mm",
        },
         -2 : {
             "කාලගුණය" : "සවස 2.00න් පසුව වැසි හෝ ගිගුරුම් සහිත වැසි ඇති  විය හැක\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (60-65) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 80mm",
        },
        -1 : {
             "කාලගුණය" : "සිහින් වැසි වාර කිහිපයක්\nඋපරිම උෂ්ණත්වය - 34°C\nඅවම උෂ්ණත්වය - 24°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 50%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 40%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 50mm",
        },
        0 : {
             "කාලගුණය" : "වැසි ස්වල්පයක්\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 25°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (50-55) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 70%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 30mm",
        },
        1 : {
             "කාලගුණය" : "වැසි වාර කිහිපයක්\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 22°C",
             "සුළග" : "සුළං නැගෙනහිර දිසාවට පැ.කි.මී. (15-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 90%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 15mm",
        },
        2 : {
             "කාලගුණය" : "ගිගුරුම් සහිත තද වැසි\nඋපරිම උෂ්ණත්වය - 33°C\nඅවම උෂ්ණත්වය - 27°C",
             "සුළග" : "සුළං බස්නාහිර දෙසින් හමා එයි. පැ.කි.මී. (60-70) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 98%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 80%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 38.7mm",
        },
        3 : {
             "කාලගුණය" : "වියලි කාලගුණ තත්ත්වයක්\nඋපරිම උෂ්ණත්වය - 32°C\nඅවම උෂ්ණත්වය - 26°C",
             "සුළග" : "සුළං වයඹ දිසාවට පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 75%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 40mm",
        }
    },
    "මධ්‍යම" : {
         -3 : {
             "කාලගුණය" : "වළාකුලින් බර, ප්‍රධාන වශයෙන් වැසි රහිතයි\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 20°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (30-40) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 100mm",
        },
         -2 : {
             "කාලගුණය" : "සවස 2.00න් පසුව වැසි හෝ ගිගුරුම් සහිත වැසි ඇති  විය හැක\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 21°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (60-65) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 80mm",
        },
        -1 : {
             "කාලගුණය" : "සිහින් වැසි වාර කිහිපයක්\nඋපරිම උෂ්ණත්වය - 29°C\nඅවම උෂ්ණත්වය - 24°C",
             "සුළග" : "සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 50%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 40%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 60mm",
        },
        0 : {
             "කාලගුණය" : "වැසි බර කාලගුණයක්\nඋපරිම උෂ්ණත්වය - 22°C\nඅවම උෂ්ණත්වය - 18°C",
             "සුළග" : "සුළං දකුණු දෙසින් හමා එයි. සුළගේ වේගය විටින් විට පැ.කි.මී. (50-55) පමණ දක්වා වැඩි විය හැක.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 95%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 70%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 130mm",
        },
        1 : {
             "කාලගුණය" : "දැඩි මීදුම් සහිතයි. වැසි වාර කිහිපයක්\nඋපරිම උෂ්ණත්වය - 20°C\nඅවම උෂ්ණත්වය - 12°C",
             "සුළග" : "සුළං නැගෙනහිර දිසාවට පැ.කි.මී. (15-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 90%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 75mm",
        },
        2 : {
             "කාලගුණය" : "ගිගුරුම් සහිත තද වැසි\nඋපරිම උෂ්ණත්වය - 30°C\nඅවම උෂ්ණත්වය - 22°C",
             "සුළග" : "සුළං බස්නාහිර දෙසින් හමා එයි. පැ.කි.මී. (60-70) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 98%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 80%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 88.7mm",
        },
        3 : {
             "කාලගුණය" : "වියලි කාලගුණ තත්ත්වයක්\nඋපරිම උෂ්ණත්වය - 22°C\nඅවම උෂ්ණත්වය - 16°C",
             "සුළග" : "සුළං වයඹ දිසාවට පැ.කි.මී. (20-30) පමණ වේ.",
             "ආර්ද්‍රතාවය" : "උපරිම සාපේක්ෂ ආර්ද්‍රතාවය - 75%\nඅවම සාපේක්ෂ ආර්ද්‍රතාවය - 60%",
             "වර්ෂාපතනය" : "උපරිම වර්ෂාපතනය - 60mm",
        }
    }
}

weather_summary = {
     0 : "කන්කසන්තුරය සිට පුත්තලම, කොළඹ සහ ගාල්ල හරහා හම්බන්තොට දක්වා වන මුහුදු ප්‍රදේශවලතැනින් තැන වැසි ඇතිවේ. දිවයින වටා වන ගැඹුරු සහ නොගැඹුරු මුහුදු ප්‍රදේශවල සුළං වේගයේ තරමක වැඩි වීමක් අපේක්ෂා කෙරේ. ධීවර සහ නාවික ප්‍රජාව මේ පිළිබඳ අවධානයෙන් කටයුතු කරන ලෙස ඉල්ලා සිටිනු ලැබේ.",
     1 : "බස්නාහිර, සබරගමුව, මධ්‍යම සහ වයඹ පළාත්වලත් ගාල්ල සහ මාතර දිස්ත්‍රික්කවලත් වැසි වාර කිහිපයක් ඇතිවේ. ඌව පළාතේත් අම්පාර සහ මඩකලපුව දිස්ත්‍රික්කවලත් සවස් කාලයේදී හෝ රාත්‍රි කාලයේදී ස්ථාන ස්වල්පයක වැසි හෝ ගිගුරුම් සහිත වැසි ඇතිවිය හැක. මධ්‍යම කඳුකරයේ බටහිර බෑවුම් ප්‍රදේශවලත් උතුරු, උතුරු-මැද, වයඹ සහ දකුණු පළාත්වල සහ ත්‍රිකුණාමලය දිස්ත්‍රික්කයේ සුළගේ වේගය විටින් විට පැ.කි.මී. (30-40) දක්වා වැඩි විය හැක. ගිගුරුම් සහිත වැසි සමග ඇතිවිය හැකි තාවකාලික තද සුළං වලින් සහ අකුණු මඟින් සිදු වන අනතුරු අවම කර ගැනීමට අවශ්‍ය පියවර ගන්නා ලෙස ජනතාවගෙන් කාරුණිකව ඉල්ලා සිටිනු ලැබේ.",
     2 : "දිවයින වටා වන මුහුදු ප්‍රදේශවල සුළං නිරිත දෙසින් හමා එයි. සුළගේ වේගය පැ.කි.මී. (30-40) පමණ වේ. ගාල්ල සිට මාතර සහ හම්බන්තොට හරහා පොතුවිල් දක්වා සහ පුත්තලම සිට කන්කසන්තුරය දක්වා වන මුහුදු ප්‍රදේශවල සුළගේ වේගය විටින් විට පැ.කි.මී. (60-65) පමණ දක්වා වැඩි විය හැකි අතර සෙසු මුහුදු ප්‍රදේශවල සුළගේ වේගය විටින් විට පැ.කි.මී.(50-55) පමණ දක්වා වැඩි විය හැක .",
     -2 : "ප්‍රධාන වශයෙන් වැසි රහිතවේ. ගාල්ල සිට මාතර සහ හම්බන්තොට හරහා පොතුවිල් දක්වා සහ පුත්තලම සිට කන්කසන්තුරය දක්වා වන මුහුදු ප්‍රදේශ විටින් විටරළු විය හැකිඅතර සෙසු මුහුදු ප්‍රදේශ තරමක් රළු විය හැක. පුත්තලම සිට කොළඹ සහ ගාල්ල හරහා හම්බන්තොට දක්වා වන මුහුදු ප්‍රදේශවල මුහුදු රළ විටින් විට මීටර්(2.5-3.0) ක් පමණ ඉහළ යාමේ හැකියාවක් පවති",
     -1 : "බස්නාහිර, සබරගමුව, මධ්‍යම සහ වයඹ පළාත්වලත් ගාල්ල සහ මාතර දිස්ත්‍රික්කවලත් වැසි වාර කිහිපයක් ඇතිවේ. උතුරු සහ උතුරු මැද  පළාත්වල වැසි ස්වල්පයක් ඇති විය හැක. දිවයිනේ සෙසු ප්‍රදේශ වල ප්‍රධාන වශයෙන් වැසි රහිත කාලගුණ තත්ත්වයක් පවතිනු ඇත.",
}
